Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ1064DAB176.PIC
      <edc:SFRDef edc:_addr="0x1F84B0F8" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="27" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCEISTAT1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCEISTAT1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY0" edc:mask="0x1" edc:name="EIRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY1" edc:mask="0x1" edc:name="EIRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY2" edc:mask="0x1" edc:name="EIRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY3" edc:mask="0x1" edc:name="EIRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY4" edc:mask="0x1" edc:name="EIRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY5" edc:mask="0x1" edc:name="EIRDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY6" edc:mask="0x1" edc:name="EIRDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY7" edc:mask="0x1" edc:name="EIRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY8" edc:mask="0x1" edc:name="EIRDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY9" edc:mask="0x1" edc:name="EIRDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY10" edc:mask="0x1" edc:name="EIRDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY11" edc:mask="0x1" edc:name="EIRDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY12" edc:mask="0x1" edc:name="EIRDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY13" edc:mask="0x1" edc:name="EIRDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY14" edc:mask="0x1" edc:name="EIRDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY15" edc:mask="0x1" edc:name="EIRDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY16" edc:mask="0x1" edc:name="EIRDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY17" edc:mask="0x1" edc:name="EIRDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY18" edc:mask="0x1" edc:name="EIRDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY19" edc:mask="0x1" edc:name="EIRDY19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY20" edc:mask="0x1" edc:name="EIRDY20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY21" edc:mask="0x1" edc:name="EIRDY21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY22" edc:mask="0x1" edc:name="EIRDY22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY23" edc:mask="0x1" edc:name="EIRDY23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY24" edc:mask="0x1" edc:name="EIRDY24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY25" edc:mask="0x1" edc:name="EIRDY25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY26" edc:mask="0x1" edc:name="EIRDY26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY27" edc:mask="0x1" edc:name="EIRDY27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY28" edc:mask="0x1" edc:name="EIRDY28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY29" edc:mask="0x1" edc:name="EIRDY29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY30" edc:mask="0x1" edc:name="EIRDY30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY31" edc:mask="0x1" edc:name="EIRDY31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0FC" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="27" edc:access="--------------------rrrrrrrrrrrr" edc:cname="ADCEISTAT2" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="ADCEISTAT2" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY32" edc:mask="0x1" edc:name="EIRDY32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY33" edc:mask="0x1" edc:name="EIRDY33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY34" edc:mask="0x1" edc:name="EIRDY34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY35" edc:mask="0x1" edc:name="EIRDY35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY36" edc:mask="0x1" edc:name="EIRDY36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY37" edc:mask="0x1" edc:name="EIRDY37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY38" edc:mask="0x1" edc:name="EIRDY38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY39" edc:mask="0x1" edc:name="EIRDY39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY40" edc:mask="0x1" edc:name="EIRDY40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY41" edc:mask="0x1" edc:name="EIRDY41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY42" edc:mask="0x1" edc:name="EIRDY42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY43" edc:mask="0x1" edc:name="EIRDY43" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
