Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/edc/PIC32MZ1064DAB176.PIC
      <edc:SFRDef edc:_addr="0x1F8E3158" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="USBE5CSR2" edc:desc="" edc:impl="0xffff3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000--00000000000000" edc:name="USBE5CSR2" edc:nzwidth="32" edc:por="0000000000000000--00000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXCNT" edc:desc="" edc:mask="0x3fff" edc:name="RXCNT" edc:nzwidth="14"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TEP" edc:desc="" edc:mask="0xf" edc:name="TEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PROTOCOL" edc:desc="" edc:mask="0x3" edc:name="PROTOCOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TXINTERV" edc:desc="" edc:mask="0xff" edc:name="TXINTERV" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E315C" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnn--------nnnnnnnnnnnnnnnn" edc:cname="USBE5CSR3" edc:desc="" edc:impl="0xff00ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000--------0000000000000000" edc:name="USBE5CSR3" edc:nzwidth="32" edc:por="00000000--------0000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEP" edc:desc="" edc:mask="0xf" edc:name="TEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PROTOCOL" edc:desc="" edc:mask="0x3" edc:name="PROTOCOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RXINTERV" edc:desc="" edc:mask="0xff" edc:name="RXINTERV" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="TXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="TXFIFOSZ" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="RXFIFOSZ" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3160" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBE6CSR0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBE6CSR0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="TXMAXP" edc:nzwidth="11"/>
            <edc:SFRFieldDef edc:cname="MULT" edc:desc="" edc:mask="0x1f" edc:name="MULT" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="" edc:mask="0x1" edc:name="TXPKTRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FIFONE" edc:desc="" edc:mask="0x1" edc:name="FIFONE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SETUPPKT" edc:desc="" edc:mask="0x1" edc:name="SETUPPKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXSTALL" edc:desc="" edc:mask="0x1" edc:name="RXSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLRDT" edc:desc="" edc:mask="0x1" edc:name="CLRDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NAKTMOUT" edc:desc="" edc:mask="0x1" edc:name="NAKTMOUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATGGL" edc:desc="" edc:mask="0x1" edc:name="DATATGGL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DTWREN" edc:desc="" edc:mask="0x1" edc:name="DTWREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQMD" edc:desc="" edc:mask="0x1" edc:name="DMAREQMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRCDATTG" edc:desc="" edc:mask="0x1" edc:name="FRCDATTG" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQEN" edc:desc="" edc:mask="0x1" edc:name="DMAREQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1" edc:name="MODE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AUTOSET" edc:desc="" edc:mask="0x1" edc:name="AUTOSET" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="" edc:mask="0x1" edc:name="UNDERRUN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SENDSTALL" edc:desc="" edc:mask="0x1" edc:name="SENDSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SENTSTALL" edc:desc="" edc:mask="0x1" edc:name="SENTSTALL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="INCOMPTX" edc:desc="" edc:mask="0x1" edc:name="INCOMPTX" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="ISO" edc:desc="" edc:mask="0x1" edc:name="ISO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3164" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBE6CSR1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBE6CSR1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="RXMAXP" edc:nzwidth="11"/>
            <edc:SFRFieldDef edc:cname="MULT" edc:desc="" edc:mask="0x1f" edc:name="MULT" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="RXPKTRDY" edc:desc="" edc:mask="0x1" edc:name="RXPKTRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FIFOFULL" edc:desc="" edc:mask="0x1" edc:name="FIFOFULL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DERRNAKT" edc:desc="" edc:mask="0x1" edc:name="DERRNAKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REQPKT" edc:desc="" edc:mask="0x1" edc:name="REQPKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXSTALL" edc:desc="" edc:mask="0x1" edc:name="RXSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLRDT" edc:desc="" edc:mask="0x1" edc:name="CLRDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INCOMPRX" edc:desc="" edc:mask="0x1" edc:name="INCOMPRX" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATGGL" edc:desc="" edc:mask="0x1" edc:name="DATATGGL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATWEN" edc:desc="" edc:mask="0x1" edc:name="DATATWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQMD" edc:desc="" edc:mask="0x1" edc:name="DMAREQMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PIDERR" edc:desc="" edc:mask="0x1" edc:name="PIDERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQEN" edc:desc="" edc:mask="0x1" edc:name="DMAREQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUTORQ" edc:desc="" edc:mask="0x1" edc:name="AUTORQ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUTOCLR" edc:desc="" edc:mask="0x1" edc:name="AUTOCLR" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="" edc:mask="0x1" edc:name="UNDERRUN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SENDSTALL" edc:desc="" edc:mask="0x1" edc:name="SENDSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SENTSTALL" edc:desc="" edc:mask="0x1" edc:name="SENTSTALL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="INCOMPTX" edc:desc="" edc:mask="0x1" edc:name="INCOMPTX" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="ISO" edc:desc="" edc:mask="0x1" edc:name="ISO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
